===============================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
DecoderOnlyTransformer                        [512, 512, 5]             --
├─Embedding: 1-1                              [512, 512, 10]            50
├─PositionalEncoding: 1-2                     [512, 512, 10]            --
├─Dropout: 1-3                                [512, 512, 10]            --
├─ModuleList: 1-4                             --                        --
│    └─SelfAttentionDecoderLayer: 2-1         [512, 512, 10]            --
│    │    └─SelfAttentionLayer: 3-1           --                        460
│    │    └─FeedForwardLayer: 3-2             [512, 512, 10]            240
├─LayerNorm: 1-5                              [512, 512, 10]            20
├─Linear: 1-6                                 [512, 512, 5]             55
===============================================================================================
Total params: 825
Trainable params: 825
Non-trainable params: 0
Total mult-adds (M): 0.20
===============================================================================================
Input size (MB): 2.10
Forward/backward pass size (MB): 136.31
Params size (MB): 0.00
Estimated Total Size (MB): 138.41
===============================================================================================